In [17]:
import pandas as pd
import glob
import math
import xlrd
import openpyxl
import re

# Define date interval quartals

def get_quartal(date):
    if date.month in [1, 2, 3]:
        return 'Q1'
    elif date.month in [4, 5, 6]:
        return 'Q2'
    elif date.month in [7, 8, 9]:
        return 'Q3'
    else:
        return 'Q4'

In [41]:
filepath = "/Users/graciaandriamiadana/Documents/Research Culture PGR project/data/Combined PGR studenship payments 2022-23.xlsx"
df = pd.read_excel(filepath, engine= 'openpyxl')
df.head(5)

,Student ID,Budget code,A/c Code,2022-10-01 00:00:00,2022-11-01 00:00:00,2022-12-01 00:00:00,2023-01-01 00:00:00,2023-02-01 00:00:00,2023-03-01 00:00:00,2023-04-01 00:00:00,...,2023-06-01 00:00:00,2023-07-01 00:00:00,2023-08-01 00:00:00,2023-09-01 00:00:00,School,Start date,End date,Duration,Source,uplift to 1/10/2022 payment for cost of living increase
0,200343938,ECSY1A3R,3620,4515.5,NaN,NaN,4917,NaN,NaN,4917,...,NaN,4917,NaN,NaN,AIDD_EECS,2022-10-01 00:00:00,2026-09-30 00:00:00,48,BBSRC,401.5
1,220679211,ECSY1A2R,3620,NaN,NaN,6556,NaN,NaN,NaN,4917,...,NaN,4917,NaN,NaN,AIDD_EECS,2022-12-01 00:00:00,2026-11-30 00:00:00,48,BBSRC,NaN
2,200346331,BCCG1D3R,3620,5250,NaN,NaN,5750,NaN,NaN,5750,...,NaN,5750,NaN,NaN,BCI,2021-10-01 00:00:00,2024-09-30 00:00:00,36,CRUK + CoL Centre,500
3,200826925,IRM9045B,3620,4917,4917,NaN,4917,NaN,NaN,4917,...,NaN,4917,NaN,NaN,BCI,2022-10-01 00:00:00,2025-09-30 00:00:00,36,BCSC,0
4,200974709,PRN1040R,3620,4515.5,NaN,NaN,4917,NaN,NaN,4917,...,NaN,4917,NaN,NaN,BCI,2020-10-01 00:00:00,2024-09-30 00:00:00,48,BBSRC LIDo,401.5

In [42]:
# Reshape the DataFrame using pd.melt() to unpivot date columns
df_melted = pd.melt(df, id_vars=['Student ID', 'Budget code', 'A/c Code', 'School', 'Start date', 'End date', 'Duration', 'Source'],
                    var_name='Date', value_name='Amount')

# Convert 'Date' column to datetime format
df_melted['Date'] = pd.to_datetime(df_melted['Date'], errors='coerce')  # 'coerce' to handle any parsing errors

# # Convert non-numeric strings to NaN in 'Amount' columns
df_melted['Amount'] = pd.to_numeric(df_melted['Amount'], errors='coerce')

# Convert the "Source" column to strings 
df_melted["Source"] = df_melted["Source"].astype(str)

In [43]:
# Uncomment this block for dataset 2022-23
# but do not run for all other datasets

# Handle additional column ('uplift to 1/10/2022 payment for cost of living increase')
df_melted['uplift_amount'] = pd.to_numeric(df['uplift to 1/10/2022 payment for cost of living increase '], errors='coerce')

# Combine 'Amount' and 'uplift_amount' columns
df_melted['Total_Amount'] = df_melted['Amount'].fillna(0) + df_melted['uplift_amount'].fillna(0)

In [44]:
df_melted['School'] = df_melted['School'].fillna('')

# Perform case-insensitive replacements and transformations in the 'School' column of df_melted
replacements = {
    r'.*EECS.*': 'School of Electronic Engineering and Computer Science',        
    r'^.*Geog.*$': 'School of Geography',   
    r'.*BCI.*': 'Barts Cancer Institute', 
    r'.*Blizard.*': 'Blizard Institute', 
    r'.*BLIZARD.*': 'Blizard Institute',  
    r'^.*SED.*$': 'School of English and Drama' ,          
    r'^.*IPHS.*$': 'Institute of Population Health Sciences' ,         
    r'^.*SLLF.*$': 'School of Languages, Linguistics and Film' ,          
    r'^.*History.*$': 'School of History',           
    r'^.*Law.*$': 'School of Law',
    r'^.*WHRI.*$': 'William Harvey Research Institute',
    r'^.*WIPH.*$': 'Wolfson Institute of Population Health',
    r'^.*DCE_Maths.*$': 'Data-Centric Engineering/Mathematical Sciences',
    r'^.*SMS.*$': 'School of Mathematical Sciences',
    r'^.*IoD.*$': 'Institute of Dentistry',
    r'^.*SBBS.*$': 'School of Biological and Behavioural Sciences',
    r'^.*SBM.*$': 'School of Business and Management',
    r'^.*SEF.*$': 'School of Economics and Finance',
    r'^.*SEMS.*$': 'School of Engineering and Materials Science',
    r'^.*SPCS.*$': 'School of Physical and Chemical Sciences',
    r'^.*SPIR.*$': 'School of Politics and International Relations',
}         


# Iterate over the dictionary and perform replacements
for pattern, replacement in replacements.items():
    mask = df_melted['School'].str.contains(pattern, case=True, regex=True, na=False)
    df_melted.loc[mask, 'School'] = replacement

# Remove rows where 'School' is an empty string
df_melted = df_melted[df_melted['School'] != '']


print(sorted(df_melted["School"].unique().tolist()))

['BCI', 'Blizard Institute', 'DCE_Maths', 'EECS', 'IPHS', 'IoD', 'IoD_BCI', 'SBBS', 'SBM', 'SED', 'SEF', 'SEMS', 'SLLF', 'SMS', 'SPCS', 'SPIR', 'School', 'School of Geography', 'School of History', 'School of Law', 'WHRI', 'WIPH']

In [59]:
# Read the Excel file containing the category mappings
mapping_file = '/Users/graciaandriamiadana/Documents/Research Culture PGR project/data/Sources classification.xlsx'
category_mapping = pd.read_excel(mapping_file)

# Initialize an empty dictionary for replacements
replacements = {}

# Iterate over each category and its sub-names to generate regex patterns
for category in category_mapping.columns:
    for name in category_mapping[category].dropna():
        # Create a regex pattern that matches the name within any text
        pattern = rf'.*{re.escape(name)}.*'
        replacements[pattern] = category

# replacements[r'^CDA supplemen.*'] = 'UKRI'
# replacements[r'^AIM CDT.*'] = 'UKRI'

replacements[r'^\?.*'] = 'not available'
replacements[r'^nan$'] = 'not available'

# Additional entries grouped under "Charities"
charities_entries = [
    'HS Barlow Charitable Trust/ Paragraf',
    'Heart Research UK',
    'Horne Family Charitable Fdn',
    'Horne Family foundation',
    'Bowel Research UK',
    'Welcome',
    'Wellcome',
    'PWSA UK',
    'Prostate Cancer UK',
    'Stuart Hall Foundation (SHF).',
    'Versus arthritis',
    'ANTRUK (Antibiotic Research UK)',
    'Animal Free Research UK',
    'Barry Reed Foundation',
]

# Add these entries to the replacements dictionary under "Charities"
for entry in charities_entries:
    pattern = rf'.*{re.escape(entry)}.*'
    replacements[pattern] = 'Charities'

# Additional entries grouped under "Industry"
industry_entries = [
    'AstraZeneca',
    'Artios Pharma',
    'Huawei',
    'Industrial top-up',
    'Industry',
    'Industry (Creative Assembly)',
    'LTA Cola',
    'META',
    'Meta Platforms, Inc.',
    'Microsoft',
    'COLA'
]

# Add these entries to the replacements dictionary under "Industry"
for entry in industry_entries:
    pattern = rf'.*{re.escape(entry)}.*'
    replacements[pattern] = 'Industry'

# Additional entries grouped under "UKRI"
ukri_entries = [
    'CDA supplement',
    'AIM CDT',
    'LiDo',
    'LISS'
]

# Add these entries to the replacements dictionary under "UKRI"
for entry in ukri_entries:
    pattern = rf'.*{re.escape(entry)}.*'
    replacements[pattern] = 'UKRI'

# Additional entries grouped under "Internal"
internal_entries = [
    'SBBS',
    'SPIR',
    'SPCS',
    'WIPH',
    'Wolfson',
    'Supervisor Project',
    'Supervisor project',
    'Faculty',
    'Faculty Match fund',
    'Faculty Match fund.  P/T rates from 01-Oct-22.',
    'Faculty match fund (50%)',
    'BAME studentship',
    'S&E Flexible Match funding',
    'S&E Match Funded',
    '50% S&E matched funding',
    'BCSC',
    'BCSC Alexandra Carrell',
]

# Add these entries to the replacements dictionary under "Internal"
for entry in internal_entries:
    pattern = rf'.*{re.escape(entry)}.*'
    replacements[pattern] = 'Internal'

# Additional entries grouped under "Other"
other_entries = [
    'DSTL',
    'Defence Science & Tech Lab',
    'Defence Science and Tech Lab, Gov UK',
    'One off payment for CDA top up back pay. Paid out on 25-Aug-23',
    'One off payment for historial 3m cost of living uplift',
    'One-off top-up => paid in wkly list 25-apr-2023 => ideally, it wasgoint to be an extension of funding for Oct-Dec 2023 => however, the supervisor, Dr Pearce, had to put this payment through now as his grant closes in June 2023',
    'S/s via private donation',
    'Government'
]

# Add these entries to the replacements dictionary under "Other"
for entry in other_entries:
    pattern = rf'.*{re.escape(entry)}.*'
    replacements[pattern] = 'Other'

# print(replacements)

for pattern, replacement in replacements.items():
    mask = df_melted['Source'].str.contains(pattern, case=True, regex=True, na=False)
    df_melted.loc[mask, 'Source'] = replacement


print(len(df_melted["Source"].unique().tolist()))
(sorted(df_melted["Source"].unique().tolist()))

46

['50% LMK Thermosafe',
 'Acutus Medical',
 'Aston Martin Formula One Team',
 'Bela - 25%',
 'Belgian Rsch Inst, VITO',
 'Byte Dance',
 'CDT',
 'Carbon Numbers Ltd and match funded',
 'Charities',
 'DAACI',
 'DEFRA',
 'Deepmind',
 'Delphia',
 'EDA for Consulatancy Project',
 'EPRSC DTP CASE Conversion 2021',
 'ERC 2016 STG 715475',
 'EU',
 'Environmental Agency top up only',
 'Evonik Operations GmbH',
 'Flamin-GO',
 'Gamble Aware',
 'Gilead',
 'Industry',
 'Internal',
 'MRS Mini CDT 2020 (PreMMIR)',
 'Mini CDT',
 'Music Tribe - 25%',
 'NDA',
 'National Nuclear Lab Ltd',
 'National Polytechnic Inst',
 'Other',
 'Perren',
 'Perren grant',
 'Polaris Group',
 'Qinetiq',
 'Reckitt Benckiser',
 'S&E and Bit Bio Ltd',
 'Servier',
 'Source',
 'Sumitomo Corp Europe',
 'UKRI',
 'UMG - 50%',
 'Value 19-20',
 'iCASE',
 'not available',
 'stipend extension']

In [54]:
# (df_melted.head(10))

In [60]:
# Group by 'Budget code' and sum the 'Amount' for each budget code
budget_totals = df_melted.groupby('Budget code')['Total_Amount'].sum().reset_index()
budget_totals['Formatted Amount'] = budget_totals['Total_Amount'].apply(lambda x: f'£{x:,.2f}')  # Format amount as currency with pounds (£) symbol
budget_totals.rename(columns={'Budget code': 'Budget code', 'Formatted Amount': 'Total Amount (£)'}, inplace=True)

# Display the total amounts per budget code
# print(budget_totals)

#### --- if requested by quartal: --- ####
# Apply custom date intervals to 'Date' column
df_melted['Quartal'] = df_melted['Date'].apply(get_quartal)

# Group by 'Budget code' and 'Quartal' and sum the 'Amount' for each combination
budget_quartal_totals = df_melted.groupby(['Budget code', 'Quartal'])['Total_Amount'].sum().reset_index()

# Display the total amounts per budget code and quartal
# print(budget_quartal_totals)

# Group by 'School' and sum the 'Amount' for each School
studentship_payments_by_school = df_melted.groupby('School')['Total_Amount'].sum().reset_index()

# Format the 'Amount' column
studentship_payments_by_school['Formatted Amount'] = studentship_payments_by_school['Total_Amount'].apply(lambda x: f'£{x:,.2f}')  # Format amount as currency with pounds (£) symbol

# Rename columns for better display
studentship_payments_by_school.rename(columns={'School': 'School Name', 'Formatted Amount': 'Total Amount (£)'}, inplace=True)

# Display the total amounts per budget code
# print(studentship_payments_by_school)


# Group by 'Budget code' and 'Quartal' and sum the 'Amount' for each combination
studentship_payments_by_school_quartal_totals = df_melted.groupby(['School', 'Quartal'])['Total_Amount'].sum().reset_index()

# Format the 'Amount' column
studentship_payments_by_school_quartal_totals['Formatted Amount'] = studentship_payments_by_school_quartal_totals['Total_Amount'].apply(lambda x: f'£{x:,.2f}')  # Format amount as currency with pounds (£) symbol

# Rename columns for better display
studentship_payments_by_school.rename(columns={'School': 'School Name', 'Formatted Amount': 'Total Amount (£)'}, inplace=True)

# Display the total amounts per budget code and quartal
# print(studentship_payments_by_school_quartal_totals)

# Group by 'Source' and sum the 'Amount' for each School
studentship_payments_by_source = df_melted.groupby('Source')['Total_Amount'].sum().reset_index()

# Format the 'Amount' column
studentship_payments_by_source['Formatted Amount'] = studentship_payments_by_source['Total_Amount'].apply(lambda x: f'£{x:,.2f}')  # Format amount as currency with pounds (£) symbol

# Rename columns for better display
studentship_payments_by_source.rename(columns={'Source': 'Source Name', 'Formatted Amount': 'Total Amount (£)'}, inplace=True)

# Display the total amounts per budget code
studentship_payments_by_source

                            Source Name  Total_Amount Total Amount (£)
0                    50% LMK Thermosafe  9.031000e+03        £9,031.00
1                        Acutus Medical  7.703945e+03        £7,703.94
2         Aston Martin Formula One Team  1.806200e+04       £18,062.00
3                            Bela - 25%  5.017375e+03        £5,017.38
4               Belgian Rsch Inst, VITO  1.966800e+04       £19,668.00
5                            Byte Dance  0.000000e+00            £0.00
6                                   CDT  1.103850e+04       £11,038.50
7   Carbon Numbers Ltd and match funded  1.639000e+04       £16,390.00
8                             Charities  3.012546e+06    £3,012,545.56
9                                 DAACI  2.006950e+04       £20,069.50
10                                DEFRA  2.006950e+04       £20,069.50
11                             Deepmind  9.666800e+04       £96,668.00
12                              Delphia  1.475100e+04       £14,751.00
13         EDA for Consulatancy Project  1.000000e+03        £1,000.00
14       EPRSC DTP CASE Conversion 2021  2.006950e+04       £20,069.50
15                  ERC 2016 STG 715475  1.639000e+03        £1,639.00
16                                   EU  8.903092e+04       £89,030.92
17     Environmental Agency top up only  1.000000e+03        £1,000.00
18               Evonik Operations GmbH  1.966800e+04       £19,668.00
19                            Flamin-GO  3.278000e+03        £3,278.00
20                         Gamble Aware  1.204133e+04       £12,041.33
21                               Gilead  8.388500e+03        £8,388.50
22                             Industry  3.014976e+05      £301,497.64
23                             Internal  6.604558e+06    £6,604,558.28
24          MRS Mini CDT 2020 (PreMMIR)  2.006950e+04       £20,069.50
25                             Mini CDT  2.006950e+04       £20,069.50
26                    Music Tribe - 25%  5.017375e+03        £5,017.38
27                                  NDA  2.000312e+03        £2,000.31
28             National Nuclear Lab Ltd  1.806200e+04       £18,062.00
29            National Polytechnic Inst  3.136000e+03        £3,136.00
30                                Other  3.335162e+05      £333,516.20
31                               Perren  4.917000e+03        £4,917.00
32                         Perren grant  1.475100e+04       £14,751.00
33                        Polaris Group  2.006950e+04       £20,069.50
34                              Qinetiq  5.820100e+04       £58,201.00
35                    Reckitt Benckiser  1.728500e+04       £17,285.00
36                  S&E and Bit Bio Ltd  2.006950e+04       £20,069.50
37                              Servier  1.898000e+04       £18,980.00
38                               Source  0.000000e+00            £0.00
39                 Sumitomo Corp Europe  1.806200e+04       £18,062.00
40                                 UKRI  6.077245e+06    £6,077,245.31
41                            UMG - 50%  6.556000e+03        £6,556.00
42                          Value 19-20  4.194250e+03        £4,194.25
43                                iCASE  2.760000e+03        £2,760.00
44                        not available  1.618923e+05      £161,892.26
45                    stipend extension  8.750000e+03        £8,750.00

In [26]:
budget_totals

    Budget code   Total_Amount Total Amount (£)
0      ART4020B   10309.750000       £10,309.75
1      ART4020B  344086.730000      £344,086.73
2      ART4040B   20069.500000       £20,069.50
3      ASTF1A9R       0.000000            £0.00
4      ASTF1B3R   14751.000000       £14,751.00
..          ...            ...              ...
553    TMTL1D5R   24142.000000       £24,142.00
554    TMTP1A4R    6020.666667        £6,020.67
555    TMTW1A2R    3200.000000        £3,200.00
556    TMTY1A3R   20069.500000       £20,069.50
557    bud code       0.000000            £0.00

[558 rows x 3 columns]

In [27]:
# studentship_payments_by_source[studentship_payments_by_source['Source Name'] == "LIDo (BBSRC)"]
studentship_payments_by_source

,Source Name,Total_Amount,Total Amount (£)
0,50% LMK Thermosafe,9031.000000,"£9,031.00"
1,ANTRUK (Antibiotic Research UK),18489.675000,"£18,489.67"
2,ARSACS,20062.000000,"£20,062.00"
3,Acutus Medical,7703.945000,"£7,703.94"
4,Animal Free Research UK,10091.365000,"£10,091.36"
...,...,...,...
168,Versus arthritis,11930.000000,"£11,930.00"
169,Zhoukou Tianjiukang Pharmaceutical Co. Ltd.,3750.000000,"£3,750.00"
170,iCASE,2760.000000,"£2,760.00"
171,n/a,169849.756667,"£169,849.76"
172,stipend extension,8750.000000,"£8,750.00"

In [28]:
studentship_payments_by_school

            School Name  Total_Amount Total Amount (£)
0                   BCI  1.437206e+06    £1,437,205.62
1     Blizard Institute  1.144177e+06    £1,144,176.92
2             DCE_Maths  1.162625e+04       £11,626.25
3                  EECS  2.928362e+06    £2,928,361.71
4                  IPHS  1.497300e+04       £14,973.00
5                   IoD  4.978480e+04       £49,784.80
6               IoD_BCI  2.050750e+04       £20,507.50
7                  SBBS  1.320697e+06    £1,320,697.31
8                   SBM  6.821622e+05      £682,162.25
9                   SED  4.797182e+05      £479,718.25
10                  SEF  8.630242e+05      £863,024.25
11                 SEMS  1.552835e+06    £1,552,834.50
12                 SLLF  5.658201e+05      £565,820.09
13                  SMS  8.014515e+05      £801,451.50
14                 SPCS  1.355680e+06    £1,355,680.40
15                 SPIR  4.050622e+05      £405,062.23
16               School  0.000000e+00            £0.00
17  School of Geography  6.081905e+05      £608,190.46
18    School of History  2.564671e+05      £256,467.08
19        School of Law  4.309379e+05      £430,937.92
20                 WHRI  1.150153e+06    £1,150,153.46
21                 WIPH  1.069954e+06    £1,069,953.75

In [29]:
studentship_payments_by_school_quartal_totals

               School Quartal   Total_Amount Formatted Amount
0                 BCI      Q1  374000.533333      £374,000.53
1                 BCI      Q2  336123.750000      £336,123.75
2                 BCI      Q3  330234.000000      £330,234.00
3                 BCI      Q4  396847.333333      £396,847.33
4   Blizard Institute      Q1  291210.881900      £291,210.88
..                ...     ...            ...              ...
83               WHRI      Q4  304288.947500      £304,288.95
84               WIPH      Q1  266884.265000      £266,884.27
85               WIPH      Q2  268415.407527      £268,415.41
86               WIPH      Q3  256744.450000      £256,744.45
87               WIPH      Q4  277909.625000      £277,909.62

[88 rows x 4 columns]